module.exports = {
  someSidebar:{
    '简介': [
      '简介/概述',
      '简介/优势',
      '简介/应用场景',
    ],
    '安装': [
      '安装/系统要求',
      '安装/安装',
      '安装/安装SQLServer',
      '安装/安装PostgresSQL',
      '安装/安装MongoDB',
      '安装/安装RabbitMQ',
    ],
    '快速入门': [
      '快速入门/概述',
      '快速入门/快速部署和配置',
      '快速入门/创建计划',
      '快速入门/终端执行',
      '快速入门/审核和查看',
      '快速入门/报表和分析',
    ],
    '用户使用手册': [
      {
        '网页端': [
          '用户使用手册/网页端/登录',
          '用户使用手册/网页端/自定义主页',
          '用户使用手册/网页端/管理导航栏',
          '用户使用手册/网页端/项目',
          '用户使用手册/网页端/计划',
          '用户使用手册/网页端/任务',
          '用户使用手册/网页端/审核',
          '用户使用手册/网页端/作业树',
          '用户使用手册/网页端/报表',
          '用户使用手册/网页端/库存',
          '用户使用手册/网页端/分析',
          '用户使用手册/网页端/日志',
          '用户使用手册/网页端/知识库',          
          '用户使用手册/网页端/消息中心',                             
          '用户使用手册/网页端/地图',
          '用户使用手册/网页端/资产总览',
          '用户使用手册/网页端/人员总览',
          '用户使用手册/网页端/排班表',
          {'用户':
          [
            '用户使用手册/网页端/用户信息',
            '用户使用手册/网页端/修改密码',
            '用户使用手册/网页端/个性设置',
            '用户使用手册/网页端/消息订阅',
            '用户使用手册/网页端/系统日志',
            '用户使用手册/网页端/下载终端应用',
            '用户使用手册/网页端/注销',
          ]
          },
          {'配置':
          [
            '用户使用手册/网页端/日志主题',
            '用户使用手册/网页端/资源',
            '用户使用手册/网页端/资产位置',
            '用户使用手册/网页端/作业组模板',
            '用户使用手册/网页端/子项模板',
            '用户使用手册/网页端/库存导入',
            '用户使用手册/网页端/画面',
          ]
          },
          {'管理':
            [
            
            '用户使用手册/网页端/作业组维护',
            '用户使用手册/网页端/系统扩展管理',
            '用户使用手册/网页端/消息类型管理',
            '用户使用手册/网页端/权限设置',
            '用户使用手册/网页端/网站设置',
            '用户使用手册/网页端/自定义导航',
            '用户使用手册/网页端/消息订阅管理',
          ]
      }]
      },
     {
       '终端': [
          '用户使用手册/终端/登录',
          '用户使用手册/终端/配置',
          '用户使用手册/终端/同步',
          '用户使用手册/终端/主页',
          '用户使用手册/终端/执行',
          '用户使用手册/终端/审核',
          '用户使用手册/终端/日志',
          '用户使用手册/终端/消息',
        ]
      },
   ],
   '系统配置手册': [
     '系统配置手册/授权管理/授权管理',
     {
      '系统设置': [
       '系统配置手册/系统设置/服务/服务',
       '系统配置手册/系统设置/系统参数/系统参数',
       ]
      },
     '系统配置手册/账户设置/账户设置',
     '系统配置手册/数据库管理/数据库管理',
     '系统配置手册/解决方案管理/解决方案管理',
     '系统配置手册/部署模型管理/部署模型管理',
     '系统配置手册/解决方案设置/解决方案设置',
     {
      '列表管理器': [
       '系统配置手册/列表管理器/概述',
       '系统配置手册/列表管理器/自定义列表',
       '系统配置手册/列表管理器/附件',
       '系统配置手册/列表管理器/工程单位',
       '系统配置手册/列表管理器/例外等级',
       '系统配置手册/列表管理器/全局属性模板',
       '系统配置手册/列表管理器/轮班',
       '系统配置手册/列表管理器/资产类别',
       '系统配置手册/列表管理器/资产',
       ]
      },
     {
      '组织架构管理器': [
       '系统配置手册/组织架构管理器/概述',
       '系统配置手册/组织架构管理器/业务范畴',
       '系统配置手册/组织架构管理器/岗位',
       '系统配置手册/组织架构管理器/组织单元',
       '系统配置手册/组织架构管理器/用户',
       ] 
       },
      '系统配置手册/流程管理器/流程管理器',
      {
      '作业管理器': [
        '系统配置手册/作业管理器/概述',
        '系统配置手册/作业管理器/项目模板',
       {'作业规范': [ 
        '系统配置手册/作业管理器/作业规范概述',
        '系统配置手册/作业管理器/作业规范',
        '系统配置手册/作业管理器/作业规范下作业',
        '系统配置手册/作业管理器/作业规范下作业项',
        ]
        },
        {'作业组': [
        '系统配置手册/作业管理器/作业组概述',
        '系统配置手册/作业管理器/作业组',
        '系统配置手册/作业管理器/作业组下作业',
        '系统配置手册/作业管理器/作业组下作业项',
        ]
        },
      ]
       },
      '系统配置手册/内置流程后和终端函数',
      {
      '模板详细说明': [
        '系统配置手册/模板详细说明/概述',
        '系统配置手册/模板详细说明/基础模板',
        '系统配置手册/模板详细说明/巡检和维修作业模板',
        '系统配置手册/模板详细说明/设备管理模板',
        '系统配置手册/模板详细说明/安全作业模板',
      ] 
       }, 
    ],
    '系统维护指南': [
      '系统维护指南/运行监控和维护',
      '系统维护指南/数据备份和还原',
    ],
    '系统扩展指南': [
      '系统扩展指南/主页定制扩展开发',
      '系统扩展指南/流程后函数扩展开发',
      '系统扩展指南/报表扩展开发',
      '系统扩展指南/分析扩展开发',
      '系统扩展指南/终端页面扩展开发',
      '系统扩展指南/自定义服务扩展开发',
      '系统扩展指南/扩展例子',
      '系统扩展指南/与自控系统集成例子',
      '系统扩展指南/社交平台集成示例-作业任务钉钉推送',
      '系统扩展指南/资产属性终端自定义查询',
      '系统扩展指南/nodejs程序配置成windows服务',
      '系统扩展指南/RabbitMQ开发说明',
    ],
    '最佳实践': [
      '最佳实践/配置最佳实践',
      '最佳实践/维护最佳实践',
    ],
    '发布说明': [
      '发布说明/发布记录',
      '发布说明/3.8.1发布说明',
      '发布说明/3.8.2发布说明',
      '发布说明/4.0.0发布说明',
      '发布说明/4.0.1发布说明',
      '发布说明/4.0.2发布说明',
    ],
    '故障排查指南': [
      '故障排查指南/移动工作站',
      '故障排查指南/企业运营中心',
      '故障排查指南/解决方案开发中心',
      '故障排查指南/解决方案管理中心',
      '故障排查指南/后台及Restful API',
      '故障排查指南/数据库管理',
      '故障排查指南/其它',
    ],
    '附录': [
      '附录/软件和应用升级',
      '附录/大屏配置和使用',
      '附录/作业树模板配置和使用',
      '附录/使用条码标签',
      '附录/使用RFID或NFC标签',
      '附录/使用超高频标签',
      '附录/使用AIC8600测温测振设备',
      '附录/使用AR智能眼镜和远程指导',
      '附录/使用钛准定位',
    ],
  },
};
